##PyCham
```
Горячие клавиши
Ctrl+Shift+A - навигация по меню, поиск команд
Ctrl+Tab - переключение между открытыми окнами
Ctrl+J - вставка html кода, очень помогает быстро писать теги
Ctrl+Alt+J - окружение выделенной области в html тег
Ctrl+/ - комментирование выделенной области
Ctrl+ Shift + / - многострочное комментирование выделенной области
Ctrl+N - поиск классов
Ctrl+D - дублирование строки или выделенной области
Ctrl+W, Ctrl+Shift+W - добавление выделения к указанной области и вычитание ее
Ctrl+F - поиск строки в текущем файле
Ctrl+Shift+F - поиск строки во всем проекте
Ctrl+Shift+F7 - быстрый просмотр использования выделенных символов в текущем файле 
Shift, Shift - поиск везде
Ctrl+ -, Ctrl+ + - закрытие, открытие блоков кода
Ctrl+Q - вывод документации по выделенному элементу
Ctrl+O - переопределение базовых методов класса, очень классная штука для CBV
Ctrl+Alt+T - окружение логической конструкцией типа try/except
Tab, Shift+Tab - увеличение, уменьшение отступа выделенной области
```
